Computing/1.4_Network_Security.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-16 Mon 11:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1.4 - Network Security</title>
<meta name="author" content="Manas Mengle" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">1.4 - Network Security</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga5a2783">1. 1.4.1 - Threats to computer systems and networks</a>
<ul>
<li><a href="#org665059c">1.1. Forms of Attack</a></li>
<li><a href="#orgc3a68b3">1.2. Malware</a></li>
<li><a href="#org1b4836a">1.3. Social engineering</a></li>
<li><a href="#org8edf178">1.4. SQL injection</a></li>
</ul>
</li>
<li><a href="#orgc51ab7b">2. 1.4.2 - Identifying and preventing vulnerabilities.</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga5a2783" class="outline-2">
<h2 id="orga5a2783"><span class="section-number-2">1.</span> 1.4.1 - Threats to computer systems and networks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org665059c" class="outline-3">
<h3 id="org665059c"><span class="section-number-3">1.1.</span> Forms of Attack</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Network <b>Attacks</b> Come in different forms.
For example:
</p>
<ul class="org-ul">
<li><b>Passive Attacks</b>, where someone monitors data that travels across a network and intercepts data packets on the chance that it may contain sensitive information.
<ul class="org-ul">
<li>They may use <i>network-monitoring</i> hardware and software such as <i>packet sniffers</i>.</li>
<li>This makes them <i>hard to detect</i> as the hacker is quietly listening. The best defence is <b>data encryption</b></li>
</ul></li>
<li><b>Active Attacks</b>, where someone attacks a network with <a href="#orgc3a68b3">Malware</a> or other planned attacks.
<ul class="org-ul">
<li>These are more easily detected, and the main defence is a <b>firewall</b></li>
</ul></li>
<li><a id="org480671f"></a>*Insider Attacks*, where someone within an organisation exploits their access to steal information.</li>
<li><b>Brute Force Attacks</b>, where an attacker <i>actively</i> tries to gain information by cracking security through <i>trial and error</i>.
<ul class="org-ul">
<li>They use automated software to produce hundreds of likely combinations on the chance that one is correct.</li>
<li>The best defence for these attacks are simple measures such as <b>locking accounts after too many failed attempts</b> and <b>stronger passwords</b></li>
</ul></li>
<li><b>Denial of Service (DoS) Attacks</b>, where a hacker tries to prevent users from accessing a network or website by flooding it with useless traffic, making it <b>extremely slow or inaccessible</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3a68b3" class="outline-3">
<h3 id="orgc3a68b3"><span class="section-number-3">1.2.</span> Malware</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><b>Malware (Malicious Software)</b> is installed on someones device, typically without their permission.</li>
<li>Typical actions that malware take include:
<ol class="org-ol">
<li><b>Deleting</b> or modifying files</li>
<li><b>Sacreware</b>, where the user is scared into paying the malware creators for the computer to be uninfected.</li>
<li><b>Locking Files</b>, such as <i>ransomware</i></li>
<li><b>Spyware</b></li>
<li><b>Rootkits</b>, which <i>alter user permissions</i> and give hackers administrator access.</li>
<li>Opening <b>Back-doors</b>, or holes in someones security.</li>
</ol></li>
<li>Malware can <b>access</b> your device in different ways
<ol class="org-ol">
<li><b>Viruses</b> attach themselves to certain files, such as programs, so that when the file is run, they are activated.</li>
<li><b>Worms</b> are like viruses, but <b>self-replicate</b>, meaning that they can spread very quickly.</li>
<li><b>Trojans</b> are malware <b>designed as legitimate software</b>. They do not replicate themselves, instead relying on <b>unsuspecting users to install them</b>.</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org1b4836a" class="outline-3">
<h3 id="org1b4836a"><span class="section-number-3">1.3.</span> Social engineering</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Social engineering is the way of <b>gaining sensitive information by influencing people</b>. A common form relies on a <b>telephone scam call</b>, where people <b>pretend to be an administrator</b>, and persuade people to <b>disclose personal information</b>, such as <i>login details</i>.
Another type is <b>Phishing</b>, where <b>scam emails or texts</b> are sent, claiming to be from <b>a reputable company</b>, attempting to trick people into <b>disclosing sensitive info</b>, such as <i>bank details</i>. They are often <b>sent to thousands</b> of people, in the hope that someone will fall prey. To combat this, many email programs have <b>anti-phishing</b> features.
</p>
</div>
</div>
<div id="outline-container-org8edf178" class="outline-3">
<h3 id="org8edf178"><span class="section-number-3">1.4.</span> SQL injection</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Networks make use of databases, which are queried using <b>SQL</b>. <b>Injections</b> are <b>pieces of SQL</b> typed into a <b>website&rsquo;s input box</b>, causing a <b>malicious SQL query</b> to be carried out, such as all login information being outputted. If a websites SQL code is <b>insecure</b>, it can be <b>an easy way</b> for hackers to get past a firewall.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc51ab7b" class="outline-2">
<h2 id="orgc51ab7b"><span class="section-number-2">2.</span> 1.4.2 - Identifying and preventing vulnerabilities.</h2>
<div class="outline-text-2" id="text-2">
<p>
Common prevention methods include:
</p>
<ul class="org-ul">
<li><b>Penetration Testing</b>, where <b>specialists simulate attacks</b> on a network to <b>identify weaknesses</b> before they are exploited.</li>
<li><b>Physical Security</b>, where the <b>physical elements of a network are protected</b> from damage, both intentional and unintentional. This can be done through <b>Locks, pass codes and surveillance</b></li>
<li><b>Passwords</b>, to prevent <b>unauthorised users</b> gaining access.</li>
<li><b>User access levels</b>, to <b>limit the number of people with access</b> to sensitive information, preventing <a href="#org480671f">3</a> on the network.</li>
<li><b>Anti-malware software</b>, to <b>find and stop malware</b> from damaging a network and its devices.</li>
<li><b>Firewalls</b>, to <b>block unauthorised devices</b> from gaining access.</li>
<li><b>Encryption</b>, to <b>protect data</b> travelling <b>over a network</b> securely.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manas Mengle</p>
<p class="date">Created: 2022-05-16 Mon 11:00</p>
</div>
</body>
</html>
